#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.foreign_language_reader will be updated in-place
  ~ resource "digitalocean_kubernetes_cluster" "foreign_language_reader" {
        cluster_subnet = "10.244.0.0/16"
        created_at     = "2020-04-05 23:21:20 +0000 UTC"
        endpoint       = "https://08e0b524-cd79-42c7-860a-06aa1108a4b6.k8s.ondigitalocean.com"
        id             = "08e0b524-cd79-42c7-860a-06aa1108a4b6"
        ipv4_address   = "167.172.121.59"
        kube_config    = (sensitive value)
        name           = "foreign-language-reader"
        region         = "sfo2"
        service_subnet = "10.245.0.0/16"
        status         = "running"
        tags           = [
            "prod",
        ]
        updated_at     = "2020-04-05 23:41:48 +0000 UTC"
        version        = "1.16.6-do.2"

      ~ node_pool {
            actual_node_count = 6
            auto_scale        = true
            id                = "2c0cb4cf-eb22-4c19-8055-e25741e509af"
            labels            = {}
            max_nodes         = 6
          ~ min_nodes         = 1 -> 3
            name              = "worker-pool"
            node_count        = 0
            nodes             = [
                {
                    created_at = "2020-04-05 23:21:20 +0000 UTC"
                    droplet_id = "187491607"
                    id         = "73780752-62f5-45e4-a90f-400214a7964b"
                    name       = "worker-pool-3nc9l"
                    status     = "running"
                    updated_at = "2020-04-05 23:24:38 +0000 UTC"
                },
                {
                    created_at = "2020-04-05 23:21:20 +0000 UTC"
                    droplet_id = "187491606"
                    id         = "a0a967ae-4050-4edf-81a7-f111ebbec1d4"
                    name       = "worker-pool-3nc92"
                    status     = "running"
                    updated_at = "2020-04-05 23:24:38 +0000 UTC"
                },
                {
                    created_at = "2020-04-05 23:21:20 +0000 UTC"
                    droplet_id = "187491605"
                    id         = "ffdaeb15-54d4-4e83-9221-bddfa68476ab"
                    name       = "worker-pool-3nc9p"
                    status     = "running"
                    updated_at = "2020-04-05 23:24:38 +0000 UTC"
                },
                {
                    created_at = "2020-04-05 23:39:08 +0000 UTC"
                    droplet_id = "187492793"
                    id         = "e737a13f-2c1b-48f1-be04-1609973c4ebd"
                    name       = "worker-pool-3n73c"
                    status     = "running"
                    updated_at = "2020-04-05 23:41:08 +0000 UTC"
                },
                {
                    created_at = "2020-04-05 23:39:08 +0000 UTC"
                    droplet_id = "187492788"
                    id         = "2c4275b8-10ff-4ad2-b625-31e8881b5850"
                    name       = "worker-pool-3n737"
                    status     = "running"
                    updated_at = "2020-04-05 23:41:08 +0000 UTC"
                },
                {
                    created_at = "2020-04-05 23:39:08 +0000 UTC"
                    droplet_id = "187492789"
                    id         = "1103b675-8809-441d-b345-1fa0230f7b16"
                    name       = "worker-pool-3n73m"
                    status     = "running"
                    updated_at = "2020-04-05 23:41:08 +0000 UTC"
                },
            ]
            size              = "s-2vcpu-4gb"
            tags              = []
        }
    }

  # module.infrastructure.module.elasticsearch.helm_release.elasticsearch is tainted, so must be replaced
-/+ resource "helm_release" "elasticsearch" {
        atomic                     = false
        chart                      = "elasticsearch"
        cleanup_on_fail            = false
        dependency_update          = false
        disable_crd_hooks          = false
        disable_openapi_validation = false
        disable_webhooks           = false
        force_update               = false
      ~ id                         = "elasticsearch" -> (known after apply)
        max_history                = 0
      ~ metadata                   = [
          - {
              - chart     = "elasticsearch"
              - name      = "elasticsearch"
              - namespace = "default"
              - revision  = 1
              - values    = jsonencode(
                    {
                      - esConfig       = {
                          - elasticsearch.yml = <<~EOT
                                xpack.security.enabled: true
                                xpack.security.transport.ssl.enabled: true
                                xpack.security.transport.ssl.verification_mode: certificate
                                xpack.security.transport.ssl.key: /usr/share/elasticsearch/config/certs/private_key_pem.crt
                                xpack.security.transport.ssl.certificate: /usr/share/elasticsearch/config/certs/certificate_pem.crt
                                xpack.security.transport.ssl.certificate_authorities: [ "/usr/share/elasticsearch/config/certs/issuer_pem.crt" ]
                            EOT
                        }
                      - extraEnvs      = [
                          - {
                              - name      = "ELASTIC_PASSWORD"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "password"
                                      - name = "elastic-credentials"
                                    }
                                }
                            },
                          - {
                              - name      = "ELASTIC_USERNAME"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "username"
                                      - name = "elastic-credentials"
                                    }
                                }
                            },
                        ]
                      - readinessProbe = {
                          - failureThreshold    = 5
                          - initialDelaySeconds = 30
                          - periodSeconds       = 10
                          - successThreshold    = 3
                          - timeoutSeconds      = 5
                        }
                      - secretMounts   = [
                          - {
                              - name       = "elastic-certificates"
                              - path       = "/usr/share/elasticsearch/config/certs"
                              - secretName = "elasticsearch-certificates"
                            },
                        ]
                    }
                )
              - version   = "7.6.1"
            },
        ] -> (known after apply)
        name                       = "elasticsearch"
        namespace                  = "default"
        recreate_pods              = false
        render_subchart_notes      = true
        replace                    = false
        repository                 = "https://helm.elastic.co"
        reset_values               = false
        reuse_values               = false
        skip_crds                  = false
      ~ status                     = "failed" -> "deployed"
        timeout                    = 300
      ~ values                     = [
          - <<~EOT
                esConfig:
                  elasticsearch.yml: |
                    xpack.security.enabled: true
                    xpack.security.transport.ssl.enabled: true
                    xpack.security.transport.ssl.verification_mode: certificate
                    xpack.security.transport.ssl.key: /usr/share/elasticsearch/config/certs/private_key_pem.crt
                    xpack.security.transport.ssl.certificate: /usr/share/elasticsearch/config/certs/certificate_pem.crt
                    xpack.security.transport.ssl.certificate_authorities: [ "/usr/share/elasticsearch/config/certs/issuer_pem.crt" ]
                
                extraEnvs:
                  - name: ELASTIC_PASSWORD
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: password
                  - name: ELASTIC_USERNAME
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: username
                
                readinessProbe:
                  failureThreshold: 5
                  initialDelaySeconds: 30
                  periodSeconds: 10
                  successThreshold: 3
                  timeoutSeconds: 5
                
                secretMounts:
                  - name: elastic-certificates
                    secretName: elasticsearch-certificates
                    path: /usr/share/elasticsearch/config/certs
            EOT,
          + <<~EOT
                esConfig:
                  elasticsearch.yml: |
                    xpack:
                      security:
                        enabled: true
                        transport:
                          ssl:
                            enabled: true
                            verification_mode: certificate
                            key: /usr/share/elasticsearch/config/certs/private_key_pem.crt
                            certificate: /usr/share/elasticsearch/config/certs/certificate_pem.crt
                            certificate_authorities: [ "/usr/share/elasticsearch/config/certs/issuer_pem.crt" ]
                
                  roles.yml: |
                    healthcheck:
                      cluster: [ 'monitor' ]
                    logging:
                      cluster: [ 'monitor' ]
                
                extraEnvs:
                  - name: ELASTIC_PASSWORD
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: password
                  - name: ELASTIC_USERNAME
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: username
                
                readinessProbe:
                  failureThreshold: 5
                  initialDelaySeconds: 30
                  periodSeconds: 10
                  successThreshold: 3
                  timeoutSeconds: 5
                
                secretMounts:
                  - name: elastic-certificates
                    secretName: elasticsearch-certificates
                    path: /usr/share/elasticsearch/config/certs
            EOT,
        ]
        verify                     = false
        version                    = "7.6.1"
        wait                       = true
    }

  # module.infrastructure.module.elasticsearch.helm_release.kibana is tainted, so must be replaced
-/+ resource "helm_release" "kibana" {
        atomic                     = false
        chart                      = "kibana"
        cleanup_on_fail            = false
        dependency_update          = false
        disable_crd_hooks          = false
        disable_openapi_validation = false
        disable_webhooks           = false
        force_update               = false
      ~ id                         = "kibana" -> (known after apply)
        max_history                = 0
      ~ metadata                   = [
          - {
              - chart     = "kibana"
              - name      = "kibana"
              - namespace = "default"
              - revision  = 1
              - values    = jsonencode(
                    {
                      - extraEnvs    = [
                          - {
                              - name      = "ELASTICSEARCH_USERNAME"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "username"
                                      - name = "elastic-credentials"
                                    }
                                }
                            },
                          - {
                              - name      = "ELASTICSEARCH_PASSWORD"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "password"
                                      - name = "elastic-credentials"
                                    }
                                }
                            },
                          - {
                              - name      = "KIBANA_ENCRYPTION_KEY"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "encryptionkey"
                                      - name = "elastic-credentials"
                                    }
                                }
                            },
                        ]
                      - kibanaConfig = {
                          - kibana.yml = <<~EOT
                                xpack.security.encryptionKey: ${KIBANA_ENCRYPTION_KEY}
                            EOT
                        }
                    }
                )
              - version   = "7.6.1"
            },
        ] -> (known after apply)
        name                       = "kibana"
        namespace                  = "default"
        recreate_pods              = false
        render_subchart_notes      = true
        replace                    = false
        repository                 = "https://helm.elastic.co"
        reset_values               = false
        reuse_values               = false
        skip_crds                  = false
      ~ status                     = "failed" -> "deployed"
        timeout                    = 300
        values                     = [
            <<~EOT
                extraEnvs:
                  - name: 'ELASTICSEARCH_USERNAME'
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: username
                  - name: 'ELASTICSEARCH_PASSWORD'
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: password
                  - name: 'KIBANA_ENCRYPTION_KEY'
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: encryptionkey
                
                kibanaConfig:
                  kibana.yml: |
                    xpack.security.encryptionKey: ${KIBANA_ENCRYPTION_KEY}
            EOT,
        ]
        verify                     = false
        version                    = "7.6.1"
        wait                       = true
    }

  # module.infrastructure.module.language_service.kubernetes_deployment.language_service is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "language_service" {
      ~ id = "default/language-service" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 2 -> (known after apply)
          - labels           = {} -> null
            name             = "language-service"
            namespace        = "default"
          ~ resource_version = "5056" -> (known after apply)
          ~ self_link        = "/apis/apps/v1/namespaces/default/deployments/language-service" -> (known after apply)
          ~ uid              = "5d7cf772-800b-4fbc-9eef-b33cd6e142ed" -> (known after apply)
        }

      ~ spec {
            min_ready_seconds         = 0
            paused                    = false
            progress_deadline_seconds = 600
          ~ replicas                  = 2 -> 1
            revision_history_limit    = 10

            selector {
                match_labels = {
                    "app" = "language-service"
                }
            }

          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                    labels           = {
                        "app" = "language-service"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = false -> null
                    dns_policy                       = "ClusterFirst"
                    host_ipc                         = false
                    host_network                     = false
                    host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                    restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                    share_process_namespace          = false
                    termination_grace_period_seconds = 30

                  ~ container {
                      - args                     = [] -> null
                      - command                  = [] -> null
                        image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-language-service:c73332bc3e4232819ffaea6cc52c5034b74b1a21"
                      ~ image_pull_policy        = "IfNotPresent" -> (known after apply)
                        name                     = "language-service"
                        stdin                    = false
                        stdin_once               = false
                        termination_message_path = "/dev/termination-log"
                        tty                      = false

                      ~ env {
                            name = "AUTH_TOKEN"

                            value_from {

                                secret_key_ref {
                                    key  = "local_connection_token"
                                    name = "local-connection-token"
                                }
                            }
                        }
                        env {
                            name  = "ELASTICSEARCH_URL"
                            value = "http://elasticsearch-master.default.svc.cluster.local:9200"
                        }
                      ~ env {
                            name = "ELASTICSEARCH_USERNAME"

                            value_from {

                                secret_key_ref {
                                    key  = "username"
                                    name = "language-service-elastic-credentials"
                                }
                            }
                        }
                      ~ env {
                            name = "ELASTICSEARCH_PASSWORD"

                            value_from {

                                secret_key_ref {
                                    key  = "password"
                                    name = "language-service-elastic-credentials"
                                }
                            }
                        }

                      ~ liveness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 30
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                          ~ http_get {
                                path   = "/health"
                                port   = "8000"
                                scheme = "HTTP"
                            }
                        }

                      ~ port {
                            container_port = 8000
                          - host_port      = 0 -> null
                            protocol       = "TCP"
                        }

                      ~ readiness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 30
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                          ~ http_get {
                                path   = "/health"
                                port   = "8000"
                                scheme = "HTTP"
                            }
                        }

                      ~ resources {
                          ~ limits {
                              + cpu    = (known after apply)
                              ~ memory = "1288490188800m" -> "1.2Gi"
                            }

                          ~ requests {
                              + cpu    = (known after apply)
                                memory = "800Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                    }

                    image_pull_secrets {
                        name = "aws-registry"
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only   = (known after apply)
                          + secret_name = (known after apply)
                          + share_name  = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + quantity       = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
